Catalogs/ШаблоныПередачиЛицензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныПередачиЛицензий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныПередачиЛицензий/Ext/ManagerModule.bsl
// Менеджер справочника ШаблоныПередачиЛицензий.
// Принцип хранения шаблонов повторяет Справочник.ШаблоныДоговоров:
// реквизит ШаблонХранилище содержит ХранилищеЗначения со структурой
// {ТекстHTML, Вложения} (сжатие СжатиеДанных(9)).

#Область ПрограммныйИнтерфейс

// Возвращает пустую структуру шаблона.
//
// Возвращаемое значение:
//   Структура:
//     * ТекстHTML - Строка - HTML текст шаблона
//     * Вложения - Структура - вложения (картинки)
//
Функция ПустаяСтруктураШаблона() Экспорт

	Возврат Новый Структура("ТекстHTML, Вложения", "", Новый Структура);

КонецФункции

// Возвращает данные шаблона по ссылке элемента справочника.
//
// Параметры:
//   Ссылка - СправочникСсылка.ШаблоныПередачиЛицензий - элемент справочника
//
// Возвращаемое значение:
//   Структура - см. ПустаяСтруктураШаблона()
//
Функция ДанныеШаблона(Ссылка) Экспорт

	Результат = ПустаяСтруктураШаблона();

	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ШаблоныПередачиЛицензий.ШаблонХранилище КАК ШаблонХранилище
	|ИЗ
	|	Справочник.ШаблоныПередачиЛицензий КАК ШаблоныПередачиЛицензий
	|ГДЕ
	|	ШаблоныПередачиЛицензий.Ссылка = &Ссылка");

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ШаблонХранилище) Тогда
		ДанныеИзХранилища = Выборка.ШаблонХранилище.Получить();
		Если ТипЗнч(ДанныеИзХранилища) = Тип("Структура")
			И ДанныеИзХранилища.Свойство("ТекстHTML") Тогда
			Результат = ДанныеИзХранилища;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Маршрутизация форм: для существующего элемента, копирования или создания
// из типового макета открывается форма редактирования шаблона,
// для нового элемента - форма выбора прототипа.
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если ВидФормы <> "ФормаЭлемента"
		И ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		// Для существующего элемента справочника открываем форму редактирования.
		ВыбраннаяФорма = "ФормаРедактированияШаблона";
		Возврат;
	КонецЕсли;

	ИмяМакета = Неопределено;
	ЭтоКопирование = Ложь;

	// Если элемент копируется, то имя макета получаем из копируемого элемента.
	Если Параметры.Свойство("ЗначениеКопирования")
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЭтоКопирование = Истина;
	КонецЕсли;

	Если Не ЭтоКопирование Тогда
		Если Параметры.Свойство("ЗначенияЗаполнения")
			И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
			Если Параметры.ЗначенияЗаполнения.Свойство("ИмяМакета") Тогда
				ИмяМакета = Параметры.ЗначенияЗаполнения.ИмяМакета;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	Если ЭтоКопирование Или ЗначениеЗаполнено(ИмяМакета) Тогда
		ВыбраннаяФорма = "ФормаРедактированияШаблона";
	Иначе
		ВыбраннаяФорма = "ФормаЭлемента";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
